



  select 
  л.цп_рлж_схд , 
   sum (нр.йнкхвеярбн) йнкхвеярбн , 
   sum(нр.пегепб) , sum (нр.йнкхвеярбн ) йнкхвеярбн_хрнцн , 
   л.схд  , л.мЮХЛЕМНБЮМХЕ , R.RRL_FGET_PRICE(л.схд ) as жемю1  
   from 
       R.рейсыхе_нярюрйх нр, 
       R.люрепхюкш л, 
        R.нпцюмхгюжхх н   
    where  
     нр.and 
     нр.нпц_схд=н.схд 
--    and ( (н.мюхлемнбюмхе = 'ЯЙК.пл')  ) 
    and ( н.мюхлемнбюмхе = 'ЯЙК. НРБ. УПЮМЕМХЪ' )
 
 group by л.цп_рлж_схд ,   л.схд  , л.мЮХЛЕМНБЮМХЕ   
              
 
 
 