/*сМХБЕПЯЮКЭМШИ НРВ╦Р ОН НЯРЮРЙЮЛ*/
SELECT 
    DECODE(&о_йнкнмйю1, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл1,
    DECODE(&о_йнкнмйю2, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл2,
    DECODE(&о_йнкнмйю3, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл3,
    DECODE(&о_йнкнмйю4, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл4,
    DECODE(&о_йнкнмйю5, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл5,
    DECODE(&о_йнкнмйю6, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл6,
    DECODE(&о_йнкнмйю7, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL) мюхл7,
    SUM(нр.йнкхвеярбн)/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ) няр_ьр,
    SUM(нр.йнкхвеярбн/(DECODE(NVL(л.йнк_бн_б_акнйе, 0), 0, 1, NVL(л.йнк_бн_б_акнйе, 0))*DECODE(NVL(л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL(л.йнк_бн_б_йнпнайе, 0))))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ) няр_йнп,
    SUM(нр.йнкхвеярбн/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))  * DECODE (NVL (л.йнкбн_б_оюкере, 0), 0, 1, NVL (л.йнкбн_б_оюкере, 0))   * DECODE (NVL (л.йнкбн_б_пъде, 0), 0, 1, NVL (л.йнкбн_б_пъде, 0)) ))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ) няр_оюкер,
    DECODE(SUM(ноп_йнк_едхмхж(л.схд, 3, нр.йнкхвеярбн)), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 3, нр.йнкхвеярбн))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ),1)||'й ')||DECODE(SUM(ноп_йнк_едхмхж(л.схд, 2, нр.йнкхвеярбн)), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 2, нр.йнкхвеярбн))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ),1)||'а ')||DECODE(SUM(ноп_йнк_едхмхж(л.схд, 1, нр.йнкхвеярбн)), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 1, нр.йнкхвеярбн))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ),1)||'ь' ) йаь,
    SUM(нр.йнкхвеярбн*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(л.схд, &о_опюия, нр.дюрю, 4))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ) няр_$,
    SUM(нр.йнкхвеярбн*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(л.схд, &о_опюия, нр.дюрю, 3))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) ) няр_п,
    SUM ((нр.йнкхвеярбн/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))))*NVL (л.бея_йнпнайх/1000, 0))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) )  бея_йц,
    SUM ((нр.йнкхвеярбн/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))))*NVL (л.назел_йнпнайх, 0))/DECODE(&о_нярюрйх,1,1,2,((&о_нйнмвюмхе_оепхндю-&о_мювюкн_оепхндю)+1) )  назел_л3,
    ноп_лхм_рю(1,&о_цпсоою_яйкюднб) лхм_рю      
FROM
    нярюрйх_рлж нр,
    люрепхюкш л,
    нпцюмхгюжхх о,
    цпсоош_рлж цр,
    цпсоош_рлж оцр,
    нпцюмхгюжхх н
WHERE нр.рлж_схд=л.схд
  AND л.опнхгб_схд=о.схд
  AND RM_пейспяхъ_PACK.ноп_цкюбмсч_цпсоос_рлж(л.цп_рлж_схд)=цр.схд
  AND л.цп_рлж_схд=оцр.схд
  AND нр.нпц_схд=н.схд
    AND (&о_цпсоою_яйкюднб IS NULL OR &о_цпсоою_яйкюднб IS NOT NULL    AND нр.нпц_схд IN
        (
      SELECT
        нпц_схд
      FROM
        янярюб_цпсоош
      WHERE
        цп_нпц_схд=&о_цпсоою_яйкюднб
      ))
  AND (&о_юйрхбмнярэ IS NULL OR &о_юйрхбмнярэ IS NOT NULL AND DECODE(л.юйрхбмнярэ,NULL,0,л.юйрхбмнярэ)=DECODE(&о_юйрхбмнярэ,1,1,2,0))
  AND (&о_йнпм_цпсоою_рлж IS NULL OR &о_йнпм_цпсоою_рлж IS NOT NULL AND RM_пейспяхъ_PACK.ноп_цкюбмсч_цпсоос_рлж(л.цп_рлж_схд)=&о_йнпм_цпсоою_рлж)
  AND (&о_опнхгбндхрекэ IS NULL OR &о_опнхгбндхрекэ IS NOT NULL AND л.опнхгб_схд=&о_опнхгбндхрекэ)
  AND (&о_люяйю_рлж  IS NULL OR &о_люяйю_рлж  IS NOT NULL AND (л.схд LIKE ноп_мнпл_ярпнйс (LTRIM('&о_люяйю_рлж')) OR л.мюхлемнбюмхе_мнпл LIKE ноп_мнпл_ярпнйс(LTRIM('&о_люяйю_рлж'))))
  AND (нр.дюрю BETWEEN &о_мювюкн_оепхндю AND &о_нйнмвюмхе_оепхндю)
  AND &о_мювюкн_оепхндю<=&о_нйнмвюмхе_оепхндю
  AND &о_нярюрйх IN (1,2)
HAVING
  (&о_лхм_йнпнайю IS NULL OR &о_лхм_йнпнайю IS NOT NULL AND SUM((нр.йнкхвеярбн)/(DECODE(NVL(л.йнк_бн_б_акнйе,0),0,1,NVL(л.йнк_бн_б_акнйе,0))*DECODE(NVL(л.йнк_бн_б_йнпнайе,0),0,1,NVL(л.йнк_бн_б_йнпнайе,0))))>&о_лхм_йнпнайю)
GROUP BY 
  DECODE(&о_йнкнмйю1, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю2, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю3, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю4, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю5, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю6, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL),
  DECODE(&о_йнкнмйю7, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 11, TO_CHAR(нр.дюрю, 'MM.MM.YYYY'), 12, TO_CHAR(нр.дюрю, 'DD.MM.YYYY'), 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, нр.дюрю), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд),34, ''''||л.юпрхйск, NULL)

UNION

SELECT 
  DECODE(&о_йнкнмйю1, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл1,
  DECODE(&о_йнкнмйю2, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл2,
  DECODE(&о_йнкнмйю3, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл3,
  DECODE(&о_йнкнмйю4, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл4,
  DECODE(&о_йнкнмйю5, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл5,
  DECODE(&о_йнкнмйю6, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл6,
  DECODE(&о_йнкнмйю7, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL) мюхл7,
  SUM(нр.йнкхвеярбн - нр.пегепб) няр_ьр,
  SUM((нр.йнкхвеярбн - нр.пегепб)/(DECODE(NVL(л.йнк_бн_б_акнйе, 0), 0, 1, NVL(л.йнк_бн_б_акнйе, 0))*DECODE(NVL(л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL(л.йнк_бн_б_йнпнайе, 0)))) няр_йнп,
  SUM((нр.йнкхвеярбн - нр.пегепб)/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))  * DECODE (NVL (л.йнкбн_б_оюкере, 0), 0, 1, NVL (л.йнкбн_б_оюкере, 0))   * DECODE (NVL (л.йнкбн_б_пъде, 0), 0, 1, NVL (л.йнкбн_б_пъде, 0)) )) няр_оюкер,
  DECODE(SUM(ноп_йнк_едхмхж(л.схд, 3, (нр.йнкхвеярбн - нр.пегепб))), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 3, (нр.йнкхвеярбн - нр.пегепб))),1)||'й ')||DECODE(SUM(ноп_йнк_едхмхж(л.схд, 2, (нр.йнкхвеярбн - нр.пегепб))), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 2, (нр.йнкхвеярбн - нр.пегепб))),1)||'а ')||DECODE(SUM(ноп_йнк_едхмхж(л.схд, 1, (нр.йнкхвеярбн - нр.пегепб))), NULL, NULL, ROUND(SUM(ноп_йнк_едхмхж(л.схд, 1, (нр.йнкхвеярбн - нр.пегепб))),1)||'ь' ) йаь,
  SUM((нр.йнкхвеярбн - нр.пегепб)*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(л.схд, &о_опюия, (SELECT дюрю FROM рнвйх_юйрсюкэмнярх WHERE рхо_оп_схд=&о_опюия), 4)) няр_$,
  SUM((нр.йнкхвеярбн - нр.пегепб)*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(л.схд, &о_опюия, (SELECT дюрю FROM рнвйх_юйрсюкэмнярх WHERE рхо_оп_схд=&о_опюия), 3)) няр_п,
  SUM ((нр.йнкхвеярбн/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))))*NVL (л.бея_йнпнайх/1000, 0)) бея_йц,
  SUM ((нр.йнкхвеярбн/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0))))*NVL (л.назел_йнпнайх, 0)) назел_л3,
  NULL лхм_рю    
FROM
  рейсыхе_нярюрйх нр,
  люрепхюкш л,
  нпцюмхгюжхх о,
  цпсоош_рлж цр,
  цпсоош_рлж оцр,
  нпцюмхгюжхх н
WHERE  нр.рлж_схд=л.схд AND л.опнхгб_схд=о.схд
  AND RM_пейспяхъ_PACK.ноп_цкюбмсч_цпсоос_рлж(л.цп_рлж_схд)=цр.схд
  AND л.цп_рлж_схд=оцр.схд
  AND нр.нпц_схд=н.схд
  AND (&о_цпсоою_яйкюднб IS NULL OR &о_цпсоою_яйкюднб IS NOT NULL  AND нр.нпц_схд IN
      (
      SELECT
        нпц_схд
      FROM
        янярюб_цпсоош
      WHERE
        цп_нпц_схд=&о_цпсоою_яйкюднб
      ))
  AND (&о_юйрхбмнярэ IS NULL OR &о_юйрхбмнярэ IS NOT NULL AND DECODE(л.юйрхбмнярэ, NULL, 0, л.юйрхбмнярэ) = DECODE(&о_юйрхбмнярэ, 1, 1, 2, 0)  )
  AND (&о_йнпм_цпсоою_рлж IS NULL OR &о_йнпм_цпсоою_рлж IS NOT NULL AND RM_пейспяхъ_PACK.ноп_цкюбмсч_цпсоос_рлж(л.цп_рлж_схд) = &о_йнпм_цпсоою_рлж)
  AND (&о_опнхгбндхрекэ IS NULL OR &о_опнхгбндхрекэ IS NOT NULL AND л.опнхгб_схд = &о_опнхгбндхрекэ)
  AND (&о_люяйю_рлж  IS NULL OR &о_люяйю_рлж  IS NOT NULL AND (л.схд LIKE ноп_мнпл_ярпнйс (LTRIM('&о_люяйю_рлж')) OR л.мюхлемнбюмхе_мнпл LIKE ноп_мнпл_ярпнйс(LTRIM('&о_люяйю_рлж'))))
  AND &о_нярюрйх IN (3)
HAVING
  (&о_лхм_йнпнайю IS NULL OR &о_лхм_йнпнайю IS NOT NULL AND SUM((нр.йнкхвеярбн-нр.пегепб)/(DECODE(NVL(л.йнк_бн_б_акнйе,0),0,1,NVL(л.йнк_бн_б_акнйе,0))*DECODE(NVL(л.йнк_бн_б_йнпнайе,0),0,1,NVL(л.йнк_бн_б_йнпнайе,0))))>&о_лхм_йнпнайю)
  AND SUM(нр.йнкхвеярбн - нр.пегепб)<>0 
GROUP BY 
  DECODE(&о_йнкнмйю1, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю2, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю3, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю4, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю5, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю6, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL),
  DECODE(&о_йнкнмйю7, 1, цр.мюхлемнбюмхе, 3, о.мюхлемнбюмхе, 6, оцр.мюхлемнбюмхе, 7, н.юаапебхюрспю, 8, л.мюхлемнбюмхе, 20, мюйкюдмше_PCK.ноп_мдя (40933, л.схд, SYSDATE), 22, л.схд, 25, REPLACE(л.бея_йнпнайх/1000, ',', '.'), 26, REPLACE(л.назел_йнпнайх, ',', '.'), 27, л.юйрхбмнярэ, 28, ORDER_BY_PCK.рлж_цпсоою_мнпл(л.схд), 30, нр.япнй_цндмнярх, NULL)