SELECT  л.юпрхйск ,  о.йнк_бн_оювей  ьр   , м.опхлевюмхе_дкъ_оевюрх   ,  о.жемю ,  о.йнк_бн_оювей*о.жемю as ясллю  ,
 м.дЮРЮ_гЮЙПШРХЪ , м.мнлеп МНЛЕП_МЮЙКЮДМНИ_пл  , 
м.опхлевюмхе  , м.дЮРЮ


   FROM R.онгхжхх_рлж о, R.мюйкюдмше м , R.люрепхюкш л
   WHERE     о.мюйк_схд = м.схд

    and м.мнлеп like '%щк%'
    and л.схд = о.рлж_схд
--    and 
--    and л.цп_рлж_схд <> 2950
    

    
and  дЮРЮ  > to_date( '011209' , 'ddmmyy' )
    and not (  м.дЮРЮ_гЮЙПШРХЪ is null ) 
order by   м.дЮРЮ_гЮЙПШРХЪ ,  м.мнлеп 


