SELECT  
î.Íàèìåíîâàíèå_ÍÎĞÌ ,
 Ì.ÍÀÈÌÅÍÎÂÀÍÈÅ , Í.ÍÎÌÅĞ , Í.* ,
  Ï.ÊÎË_ÂÎ_ÏÀ×ÅÊ ,  Ï.ÖÅÍÀ ,  Ï.ÊÎË_ÂÎ_ÏÀ×ÅÊ*Ï.ÖÅÍÀ as ÑÓÌÌÀ

 /*,  Ï.*  */ 
   FROM R.ÏÎÇÈÖÈÈ_ÒÌÖ Ï, R.ÍÀÊËÀÄÍÛÅ Í , R.ÌÀÒÅĞÈÀËÛ Ì ,  R.Îğãàíèçàöèè Î  
   WHERE     Ï.ÍÀÊË_ÓÈÄ = Í.ÓÈÄ 
    And Î.ÓÈÄ = Í.ÎĞÃ_ÓÈÄ
  
    and  Ì.ÓÈÄ = Ï.ÒÌÖ_ÓÈÄ
   and Ì.ÃĞ_ÒÌÖ_ÓÈÄ = 2851


  and Í.ÄÎÊ_ÓÈÄ = 2 
and  Äàòà  >= to_date( '040809' , 'ddmmyy' )  
and  Äàòà  <= to_date( '270809' , 'ddmmyy' )  

    
 and ( î.Íàèìåíîâàíèå_ÍÎĞÌ  = 'ÑÊË ĞÌ' )


    

