
SELECT 
М.мНЛЕП ,
М.схд  ,
       оп.мюхлемнбюмхе опнхгбндхрекэ
     , цр.мюхлемнбюмхе цпсоою_рнбюпю
     , л.мюхлемнбюмхе рнбюп
     , (ор.йнк_бн_оювей) 
     ,(ор.йнк_бн_оювей/(DECODE (NVL (л.йнк_бн_б_акнйе, 0), 0, 1, NVL (л.йнк_бн_б_акнйе, 0)) * DECODE (NVL (л.йнк_бн_б_йнпнайе, 0), 0, 1, NVL (л.йнк_бн_б_йнпнайе, 0)))) Zйнп
     ,(ор.йнк_бн_оювей*ноп_ясллс_б_бюкчре(3, ор.жемю, м.бюк_схд, м.йспя_бюкчрш, м.дюрю_гюйпшрхъ, м.йспя_бюкчрш)) Zпса
     ,(ор.йнк_бн_оювей*  ор.жемю ) Zпса2

 /*    ,SUM(ор.йнк_бн_оювей*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(ор.рлж_схд ,1 ,м.дюрю_гюйпшрхъ, 3, м.йспя_бюкчрш)) нанпнр_яя*/

   FROM МЮЙКЮДМШЕ  М
   , онгхжхх_рлж ор
   , люрепхюкш л
   , опнхгбндхрекх оп
   , ДНЙСЛЕМРШ Д
   , цпсоош_рлж цр

WHERE М.СХД=ОР.МЮЙК_СХД
      and ОР.РЛЖ_СХД=Л.СХД
      and Л.ОПНХГБ_СХД=ОП.СХД
      and М.НПЦ_СХД in (select НПЦ_СХД from ЯНЯРЮБ_ЦПСООШ where ЦП_НПЦ_СХД= 189248 ) 
      and RM_пейспяхъ_PACK.ноп_цкюбмсч_цпсоос_рлж(л.цп_рлж_схд)=цр.схд
      and М.ДНЙ_СХД=Д.СХД 
      and Д.РХО=2
      and М.НОЕП_СХД in (1020,1021)
      and л.схд = 122354
      and (М.ДЮРЮ_ГЮЙПШРХЪ  between  to_date( '051009' , 'ddmmyy' )
      and  to_date( '110112' , 'ddmmyy' ))
