SELECT
  DECODE(N,1000000,NULL,N) N,
  схд,
  DECODE(N,щйяоедхрнп,NULL,щйяоедхрнп) бндхрекэ,
  яейрнп,
  мнлеп,
  тн н,
  чп_кхжн,
  йкхемр,
  DECODE(ясллю,0,NULL,DECODE( 'пСАКЭ' ,4,TO_CHAR(ясллю,'9999999999.00'),3,TO_CHAR(ясллю,'$9999999999.00'))) ясллю,
  DECODE(ROUND(бея,1),0,NULL,TO_CHAR(бея,'9999999999.0')) бея,
  DECODE(ROUND(назел,1),0,NULL,TO_CHAR(назел,'9999999999.0')) назел,
  юдпея,
  опхлевюмхе||'  '||ро опхлевюмхе,
  бюфмнярэ,
  ондохяэ,
  ROUND(нанпнр-ясллю,0) " "
FROM
  (SELECT * FROM (
  
  SELECT
--    *
 N,
 TRIM(TO_CHAR(схд,'9999999999')) схд,
    щйяоедхрнп,
    яейрнп,
    мнлеп,
    тн,
    чп_кхжн,
    йкхемр,
    ясллю,
    бея,
    назел,
    юдпея,
    опхлевюмхе,
    бюфмнярэ,
    ондохяэ,
    нанпнр,
    ро
    
  FROM
  (
  SELECT ROW_NUMBER() OVER
    (
    PARTITION BY щйяоедхрнп ORDER BY
      щйяоедхрнп,
      юдпея,
      чп_кхжн,
      мнлеп,
      яейрнп,
      йкхемр,
      бюфмнярэ,
      тн
    ) N,
    щйяоедхрнп,
    яейрнп,
    мнлеп,
    тн,
    чп_кхжн,
    йкхемр,
    ясллю,
    бея,
    назел,
    юдпея,
    опхлевюмхе,
    бюфмнярэ,
    ондохяэ,
    нанпнр,
    схд,
    ро
  FROM
    (
    SELECT
      м.схд схд,
      щ.юаапебхюрспю щйяоедхрнп,
      я.мюхлемнбюмхе яейрнп,
      мнлеп,
      м.рхо_нокюрш тн,
      ч.юаапебхюрспю чп_кхжн,
      йк.мюхлемнбюмхе йкхемр,
      SUM(ноп_ясллс_б_бюкчре(  'пСАКЭ'  ,ор.йнк_бн_оювей*ор.жемю,м.бюк_схд,м.йспя_бюкчрш,м.дюрю_гюйпшрхъ,м.йспя_бюкчрш)) нанпнр,
      SUM(ор.йнк_бн_оювей*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(ор.рлж_схд,DECODE(м.нпц_схд_чпкхжн,226144,1697,1),м.дюрю_гюйпшрхъ,TO_NUMBER(&о_бюкчрю),м.йспя_бюкчрш)) ясллю,
      м.бея,
      м.назел,
      йк.юдпея,
      м.опхлевюмхе,
      йк.лхяяхъ бюфмнярэ,
      NULL ондохяэ,
      ' лЕМЕДФЕП:'||Л.юаапебхюрспю||', РЕК.:'||DECODE(Л.оеидфеп,null, '<МЕ СЙЮГЮМ>',Л.оеидфеп) ро
    FROM
      мюйкюдмше м,
      онгхжхх_рлж ор,
      нпцюмхгюжхх ч,
      нпцюмхгюжхх щ,
      нпцюмхгюжхх л,
      нпцюмхгюжхх йк,
      днйслемрш д,
      яейрнпш я
    WHERE м.днй_схд=д.схд
      AND м.схд=ор.мюйк_схд
      AND д.рхо IN (2,1)
      AND м.ноеп_схд IN (1,2,3,4,7,10,1040,1041,1101,1080,-30)
      AND м.нпц_схд_лемедфеп=л.схд(+)
      AND (м.дюрю_гюйпшрхъ BETWEEN  to_date( '011009' , 'ddmmyy' ) AND    to_date( '011009' , 'ddmmyy' )    )
      AND (&о_дюрю_нок IS NULL OR &о_дюрю_нок IS NOT NULL AND м.дюрю_нокюрш=&о_дюрю_нок)
      AND м.нпц_схд_йкхемр=йк.схд(+)
      AND мюйкюдмше_ойр_ял.ноп_щйяоедхрнпю(м.схд,м.нпц_схд_щйяоедхрнп,nsi_pack.гмювемхе_яксф_оепелеммни('пефхл_щйяоедхжхх',м.дюрю_гюйпшрхъ))=щ.схд(+)
      AND (&о_щйяоедхрнп IS NULL OR &о_щйяоедхрнп IS NOT NULL AND щ.схд=&о_щйяоедхрнп)
      AND м.нпц_схд_чпкхжн=ч.схд
      AND йк.яейрнп_схд=я.схд(+)
      AND (&о_яейрнп IS NULL OR &о_яейрнп IS NOT NULL AND я.схд=&о_яейрнп)
      AND ((щ.юаапебхюрспю IS NULL AND &о_мюйк=2) OR (щ.юаапебхюрспю IS NOT NULL AND &о_мюйк=1))
    GROUP BY
      щ.юаапебхюрспю,
      я.мюхлемнбюмхе,
      м.мнлеп,
      м.рхо_нокюрш,
      ч.юаапебхюрспю,
      йк.мюхлемнбюмхе,
      йк.юдпея,
      м.опхлевюмхе,
      йк.лхяяхъ,
      м.бея,
      м.назел,
      м.бея,
      м.назел,
      м.схд,
      ' лЕМЕДФЕП:'||Л.юаапебхюрспю||', РЕК.:'||DECODE(Л.оеидфеп,null, '<МЕ СЙЮГЮМ>',Л.оеидфеп)
    ORDER BY 2,3,4,5,6,7
    ))

  UNION ALL

  SELECT
    1000000 N,
    NULL схд,
    щйяоедхрнп,
    NULL яейрнп,
    NULL мнлеп,
    NULL тн,
    NULL чп_кхжн,
    'хрнцн он цпсоое' йкхемр,
    SUM(ясллю) ясллю,
    SUM(бея) бея,
    SUM(назел) назел,
    NULL юдпея,
    NULL опхлевюмхе,
    NULL бюфмнярэ,
    NULL ондохяэ,
    SUM(нанпнр) нанпнр,
    '' ро
  FROM
    (
    SELECT
      щ.юаапебхюрспю щйяоедхрнп,
      SUM(ноп_ясллс_б_бюкчре(&о_бюкчрю,ор.йнк_бн_оювей*ор.жемю,м.бюк_схд,м.йспя_бюкчрш,м.дюрю_гюйпшрхъ,м.йспя_бюкчрш)) нанпнр,
      SUM(ор.йнк_бн_оювей*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(ор.рлж_схд,1,м.дюрю_гюйпшрхъ,TO_NUMBER(&о_бюкчрю),м.йспя_бюкчрш)) ясллю,
      м.бея,
      м.назел назел,
      м.схд
    FROM
      мюйкюдмше м,
      онгхжхх_рлж ор,
      нпцюмхгюжхх ч,
      нпцюмхгюжхх щ,
      нпцюмхгюжхх л,
      нпцюмхгюжхх йк,
      днйслемрш д,
      яейрнпш я
    WHERE м.днй_схд=д.схд
      AND м.схд=ор.мюйк_схд
      AND д.рхо IN (2,1)
      AND м.ноеп_схд IN (1,2,3,4,7,10,1040,1041,1101,1080,-30)
      AND м.нпц_схд_лемедфеп=л.схд(+)
      AND (м.дюрю_гюйпшрхъ BETWEEN &о_мювюкн_оепхндю AND &о_нйнмвюмхе_оепхндю)
      AND (&о_дюрю_нок IS NULL OR &о_дюрю_нок IS NOT NULL AND м.дюрю_нокюрш=&о_дюрю_нок)
      AND м.нпц_схд_йкхемр=йк.схд(+)
      AND мюйкюдмше_ойр_ял.ноп_щйяоедхрнпю(м.схд,м.нпц_схд_щйяоедхрнп,nsi_pack.гмювемхе_яксф_оепелеммни('пефхл_щйяоедхжхх',м.дюрю_гюйпшрхъ))=щ.схд(+)
      AND (&о_щйяоедхрнп IS NULL OR &о_щйяоедхрнп IS NOT NULL AND щ.схд=&о_щйяоедхрнп)
      AND м.нпц_схд_чпкхжн=ч.схд
      AND йк.яейрнп_схд=я.схд(+)
      AND (&о_яейрнп IS NULL OR &о_яейрнп IS NOT NULL AND я.схд=&о_яейрнп)
      AND ((щ.юаапебхюрспю IS NULL AND &о_мюйк=2) OR (щ.юаапебхюрспю IS NOT NULL AND &о_мюйк=1))
    GROUP BY
      щ.юаапебхюрспю,
      м.бея,
      м.назел,
      м.схд
    )
  GROUP BY
    щйяоедхрнп

  UNION ALL
  
  SELECT
    1000000 N,
    NULL схд,
    NULL щйяоедхрнп,
    NULL яейрнп,
    NULL мнлеп,
    NULL тн,
    NULL чп_кхжн,
    NULL йкхемр,
    SUM(ясллю) ясллю,
    SUM(бея) бея,
    SUM(назел) назел,
    'бяецн гюъбнй:  '||COUNT(схд) юдпея,
    'бшегд пюгпеьюч:' опхлевюмхе,
    NULL бюфмнярэ,
    NULL ондохяэ,
    SUM(нанпнр) нанпнр,
    '' ро
  FROM
    (
    SELECT
      м.схд,
      м.бея,
      м.назел,
      SUM(ор.йнк_бн_оювей*пюявер_опюияю_PACK.ярнхлнярэ_он_опюияс(ор.рлж_схд,1,м.дюрю_гюйпшрхъ,TO_NUMBER(&о_бюкчрю),м.йспя_бюкчрш)) ясллю,
      SUM(ноп_ясллс_б_бюкчре(&о_бюкчрю,ор.йнк_бн_оювей*ор.жемю,м.бюк_схд,м.йспя_бюкчрш,м.дюрю_гюйпшрхъ,м.йспя_бюкчрш)) нанпнр
    FROM
      мюйкюдмше м,
      онгхжхх_рлж ор,
      нпцюмхгюжхх ч,
      нпцюмхгюжхх щ,
      нпцюмхгюжхх л,
      нпцюмхгюжхх йк,
      днйслемрш д,
      яейрнпш я
    WHERE м.днй_схд=д.схд
      AND м.схд=ор.мюйк_схд
      AND д.рхо IN (2,1)
      AND м.ноеп_схд IN (1,2,3,4,7,10,1040,1041,1101,1080,-30)
      AND м.нпц_схд_лемедфеп=л.схд(+)
      AND (м.дюрю_гюйпшрхъ BETWEEN &о_мювюкн_оепхндю AND &о_нйнмвюмхе_оепхндю)
      AND (&о_дюрю_нок IS NULL OR &о_дюрю_нок IS NOT NULL AND м.дюрю_нокюрш=&о_дюрю_нок)
      AND м.нпц_схд_йкхемр=йк.схд(+)
      AND мюйкюдмше_ойр_ял.ноп_щйяоедхрнпю(м.схд,м.нпц_схд_щйяоедхрнп,nsi_pack.гмювемхе_яксф_оепелеммни('пефхл_щйяоедхжхх',м.дюрю_гюйпшрхъ))=щ.схд(+)
      AND (&о_щйяоедхрнп IS NULL OR &о_щйяоедхрнп IS NOT NULL AND щ.схд = &о_щйяоедхрнп)
      AND м.нпц_схд_чпкхжн=ч.схд
      AND йк.яейрнп_схд=я.схд(+)
      AND (&о_яейрнп IS NULL OR &о_яейрнп IS NOT NULL AND я.схд=&о_яейрнп)
      AND ((щ.юаапебхюрспю IS NULL AND &о_мюйк=2) OR (щ.юаапебхюрспю IS NOT NULL AND &о_мюйк=1))
    GROUP BY
      м.бея,
      м.назел,
      м.схд
    )
  )
  ORDER BY 3,1
)
