select ярюбхр.рлж_схд , 
ярюбхр.мЮХЛЕМНБЮМХЕ ,
ярюбхр.йнк_бн_ОЮВЕЙ ,
ямхлюер.йнк_бн_ОЮВЕЙ as мхлюеР_йнк ,
ярюбхр.жЕМЮ ,
ямхлюер.жЕМЮ

from (
SELECT л.мюхлемнбюмхе ,  о.* 
   FROM R.онгхжхх_рлж о, R.мюйкюдмше м , R.люрепхюкш л
   WHERE     о.мюйк_схд = м.схд

    and м.схд = 5380074
    and  л.схд = о.рлж_схд
    and л.цп_рлж_схд <> 2950
    
)  ярюбхр ,

 (
SELECT л.мюхлемнбюмхе ,  о.* 
   FROM R.онгхжхх_рлж о, R.мюйкюдмше м , R.люрепхюкш л
   WHERE     о.мюйк_схд = м.схд

    and м.схд = 5368355
    and  л.схд = о.рлж_схд
    and л.цп_рлж_схд <> 2950
    
)  ямхлюер

where ярюбхр.рлж_схд = ямхлюер.рлж_схд
and   ярюбхр.жЕМЮ <> ямхлюер.жЕМЮ

--5368355 √ ЯМХЛЮЕР НЯРЮРЙХ
--5380074 √ ЯРЮБХР МЮ НЯРЮРЙХ




